move_chart = {
    0 : [-1, 1, 2, 3, 4, 5],
    1 : [-1, 2, 3, 4, 5, 6],
    2 : [-1, 3, 4, 5, 6, 7],
    3 : [-1, 4, 5, 6, 7, 8],
    4 : [-1, 5, 6, 7, 8, 9],
    
    5 : [-1, 20, 21, 22, 28, 29],

    6 : [-1, 7, 8, 9, 10, 11],
    7 : [-1, 8, 9, 10, 11, 12],
    8 : [-1, 9, 10, 11, 12, 13],
    9 : [-1, 10, 11, 12, 13, 14],
    
    10 : [-1, 23, 24, 28, 29, 30], # not yet

    11 : [-1, 12, 13, 14, 15, 16],
    12 : [-1, 13, 14, 15, 16, 17],
    13 : [-1, 14, 15, 16, 17, 18],
    14 : [-1, 15, 16, 17, 18, 19],

    15 : [-1, 25, 26, 27, 28, 29],

    16 : [-1, 17, 18, 19, 31, 32],
    17 : [-1, 18, 19, 31, 32, 32],
    18 : [-1, 19, 31, 32, 32, 32],
    19 : [-1, 31, 32, 32, 32, 32],

    20 : [-1, 21, 22, 28, 29, 30],
    21 : [-1, 22, 28, 29, 30, 31],
    22 : [-1, 28, 29, 30, 31, 32],

    23 : [-1, 24, 28, 29, 30, 31],
    24 : [-1, 28, 29, 30, 31, 32],

    25 : [-1, 26, 27, 28, 29, 30],
    26 : [-1, 27, 28, 29, 30, 31],
    27 : [-1, 28, 29, 30, 31, 32],

    28 : [-1, 29, 30, 31, 32, 32],

    29 : [-1, 30, 31, 32, 32, 32],
    30 : [-1, 31, 32, 32, 32, 32],
    31 : [-1, 32, 32, 32, 32, 32],

    32 : [32, 32, 32, 32, 32, 32]
}

point_chart = [
    -1,
    2, 4, 6, 8, # 4
    10, # 5
    12, 14, 16, 18, # 9
    20, # 10
    22, 24, 26, 28, # 14
    30, # 15
    32, 34, 36, 38, #  19
    13, 16, 19, # 22
    22, 24, # 24
    28, 27, 26, # 27
    25, # 28
    30, 35, 40, # 31
    0, # 32
]

horse_pos = [0, 0, 0, 0]
move = list(map(int, input().split()))


ans = 0

def dfs(horse_pos, move, move_chart, point_chart, now_point, idx):
    global ans
    if idx == len(move):
        ans = max(now_point, ans) 
        return
    for i in range(4):
        # 초기값 도착칸 -> continue
        # 더한 값 말 이미 있다? continue, 단 32 제외
        #print(real_pos)
        real_pos = min(move_chart[horse_pos[i]][move[idx]], 32)
        tmp_pos = horse_pos[i]
        if horse_pos[i] == 32:
            continue
        elif real_pos != 32 and real_pos in horse_pos:
            continue
        else:
            # 앞뒤
            horse_pos[i] = real_pos
            dfs(horse_pos, move, move_chart, point_chart, now_point+point_chart[real_pos], idx+1)
            horse_pos[i] = tmp_pos

#도착칸은 예외

dfs(horse_pos, move, move_chart, point_chart, 0, 0)

print(ans)